# Дана строка s = 'bfgshbkis'
# Преобразовать её в строку 'ibs', используя оператор извлечения среза только один раз.

s = 'bfgshbkis'
print(s[7:2:-2])
